app/controllers/displays_controller.rb

  def index
    @displays = Display.all
---
SELECT "displays".* FROM "displays"

  def show
    @display = Display.find(params[:id])
---
SELECT "displays".* FROM "displays" WHERE "displays"."id" = ? LIMIT 1  [["id", "980190962"]]

  def edit
    @display = Display.find(params[:id])
---
SELECT "displays".* FROM "displays" WHERE "displays"."id" = ? LIMIT 1  [["id", "980190962"]]

  def create
    @display = Display.new(params[:display])

    respond_to do |format|
      if @display.save
---
INSERT INTO "displays" ("created_at", "description", "total", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 17 Jun 2016 19:49:36 UTC +00:00], ["description", "MyText"], ["total", 1], ["updated_at", Fri, 17 Jun 2016 19:49:36 UTC +00:00]]

  def update
    @display = Display.find(params[:id])
---
SELECT "displays".* FROM "displays" WHERE "displays"."id" = ? LIMIT 1  [["id", "980190962"]]

  def destroy
    @display = Display.find(params[:id])
    @display.destroy
---
SELECT "displays".* FROM "displays" WHERE "displays"."id" = ? LIMIT 1  [["id", "980190962"]]
DELETE FROM "displays" WHERE "displays"."id" = ?  [["id", 980190962]]