app/controllers/game_masters_controller.rb

SELECT "game_masters".* FROM "game_masters" WHERE "game_masters"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @game_master = GameMaster.find(params[:id])