app/controllers/game_masters_controller.rb

  def create
    @game_master = GameMaster.new(params[:game_master])
    @party = Party.new

    # Populates the party with the members
    # who were checked off
    fill_party(params[:party])

    @game_master.party = @party
    if @game_master.save
---
INSERT INTO "game_masters" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Thu, 21 Jul 2016 05:39:54 UTC +00:00], ["name", "bob master"], ["updated_at", Thu, 21 Jul 2016 05:39:54 UTC +00:00]]
INSERT INTO "parties" ("created_at", "current_level", "current_xp", "game_master_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 21 Jul 2016 05:39:54 UTC +00:00], ["current_level", nil], ["current_xp", nil], ["game_master_id", 2], ["updated_at", Thu, 21 Jul 2016 05:39:54 UTC +00:00]]

  def destroy
    @game_master = current_gm
    end_session
    @game_master.destroy
---
DELETE FROM "game_masters" WHERE "game_masters"."id" = ?  [["id", 2]]