app/controllers/pages_controller.rb

SELECT "pages".* FROM "pages"
---
  def index
    @Pages = Page.all

SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @Page = Page.find(params[:id])

SELECT "pages".* FROM "pages" WHERE "pages"."title" = 'xp tracker' LIMIT 1
---
  def xp_tracker
    @Page = Page.find_by_title("xp tracker")