app/controllers/players_controller.rb

SELECT "players".* FROM "players"
---
  def index
    @Players = Player.all

SELECT "players".* FROM "players" WHERE "players"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @Player = Player.find(params[:id])

INSERT INTO "players" ("armor_class", "created_at", "current_experience", "current_health", "initiative", "level", "name", "party_id", "passive_perception", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create

    @Player = Player.new(
      :name               => params[:player][:name],
      :level              => params[:player][:level].to_i,
      :armor_class        => params[:player][:armor_class].to_i,
      :passive_perception => params[:player][:passive_perception].to_i)

    if @Player.save!

SELECT "players".* FROM "players" WHERE "players"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "players" SET "name" = 'john', "level" = 4, "armor_class" = 10, "passive_perception" = 12, "updated_at" = '2016-07-08 07:26:39.778174' WHERE "players"."id" = 1
---
  def update
    @Player = Player.find(params[:id])
    if @Player.update_attributes(params[:player])

SELECT "players".* FROM "players" WHERE "players"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "players" WHERE "players"."id" = ?  [["id", 1]]
---
  def destroy
    @Player = Player.find(params[:id])
    if @Player.destroy